---
kind: type
id: T:Autodesk.Revit.DB.Events.RevitAPIEventStatus
source: html/a739b1f8-6b3b-a95b-b536-6e5d00d12e4e.htm
---
# Autodesk.Revit.DB.Events.RevitAPIEventStatus

Describes the status of an action which triggered a post event.

## Syntax (C#)
```csharp
public enum RevitAPIEventStatus
```